//==============================================================================
// タイトル     :   OpenGL用カメラ処理
// ファイル名   :   cameraGL.h
// 作成者       :   AT13B284 21 数藤凌哉
// 作成日       :   2016/05/13
//==============================================================================

//==============================================================================
// 更新履歴: -2016/05/13 数藤凌哉
//           ・制作開始
//==============================================================================

//==============================================================================
// インクルードガード
//==============================================================================
#pragma once

//==============================================================================
// インクルードファイル
//==============================================================================
#include "main.h"

//==============================================================================
// マクロ定義
//==============================================================================

//==============================================================================
// 構造体宣言
//==============================================================================

//==============================================================================
// クラス宣言
//==============================================================================
class CCameraGL
{
	//---------------------------------------------
	// [ メンバ関数 ]
	//---------------------------------------------
public:
	// コンストラクタ
	CCameraGL();

	// デストラクタ
	~CCameraGL();

	// 初期化処理
	virtual bool Init( VECTOR3 posV = VECTOR3( 0.0f , 1.0f , 1.0f ) , VECTOR3 posR = VECTOR3( 0.0f , 0.0f , 0.0f ) );

	// 終了処理
	virtual void Uninit( void );

	// 更新処理
	virtual void Update( void );

	// カメラ行列設定処理
	void Set( void );

	// 2D用カメラ行列設定
	void Set2D( void );

	// 2D用カメラ行列終了設定
	void End2D( void );

	// 取得処理系
	VECTOR3 GetPosV( void ){ return m_posV; }
	VECTOR3 GetPosR( void ){ return m_posR; }
	VECTOR3 GetRot( void ){ return m_rot; }
	MATRIX GetMtxProj( void );
	MATRIX GetMtxView( void );

	// 設定処理系
	void SetPosV( VECTOR3 posV ){ m_posV = posV; }
	void SetPosR( VECTOR3 posR ){ m_posR = posR; }
	void SetRot( VECTOR3 rot ){ m_rot = rot; }

	void SetDistance( float distance ){ m_fDistance = distance; }

	//---------------------------------------------
	// [ メンバ変数 ]
	//---------------------------------------------
protected:
	VECTOR3 m_posV;			// 視点
	VECTOR3 m_posR;			// 注視点
	VECTOR3 m_VecU;			// 上方向ベクトル
	VECTOR3 m_rot;			// 回転角

	float m_fDistance;		// 視点-注視点間の距離

	float m_fov;			// 視野角
	float m_nearZ;			// カメラnear値
	float m_farZ;			// カメラfar値

	bool  m_bMove;			// 移動操作受付判定
};

//==============================================================================
// プロトタイプ宣言
//==============================================================================
