//==============================================================================
// タイトル     :   DirectX用キーボード入力処理
// ファイル名   :   input.DX.Keyboard.h
// 作成者       :   AT13B284 21 数藤凌哉
// 作成日       :   2016/04/26
//==============================================================================

//==============================================================================
// 更新履歴: -2016/04/26 数藤凌哉
//           ・制作開始
//==============================================================================

//==============================================================================
// インクルードガード
//==============================================================================
#pragma once

//==============================================================================
// インクルードファイル
//==============================================================================
#include "input_DX.h"

//==============================================================================
// マクロ定義
//==============================================================================
#define DX_KEYBOARD_KEY_MAX		( 256 )		// DirectX用キーボードのキー種類数

//==============================================================================
// 構造体宣言
//==============================================================================

//==============================================================================
// 前方宣言
//==============================================================================
class CInputDX;

//==============================================================================
// クラス宣言
//==============================================================================
class CInputDXKeyboard : public CInputDX
{
	/* ===メンバ関数=== */
public:
	CInputDXKeyboard();											// コンストラクタ
	~CInputDXKeyboard();										// デストラクタ

	bool Init( HINSTANCE hInstance , HWND hWnd );				// 初期化処理
	void Uninit( void );										// 終了処理
	void Update( void );										// 更新処理

	bool GetPress( int nKey );									// Press判定取得処理
	bool GetTrigger( int nKey );								// Trigger判定取得処理
	bool GetRelease( int nKey );								// Release判定取得処理
	bool GetRepeat( int nKey );									// Repeat判定取得処理

	/* ===メンバ変数=== */
private:
	LPDIRECTINPUTDEVICE8 m_pDevKeyboard;						// 入力デバイス( キーボード )へのポインタ
	BYTE m_aKeyState[ DX_KEYBOARD_KEY_MAX ];					// キーボードの入力情報ワーク( Press用 )
	BYTE m_aKeyStateTrigger[ DX_KEYBOARD_KEY_MAX ];				// キーボードの入力情報ワーク( Trigger用 )
	BYTE m_aKeyStateRelease[ DX_KEYBOARD_KEY_MAX ];				// キーボードの入力情報ワーク( Release用 )
	BYTE m_aKeyStateRepeat[ DX_KEYBOARD_KEY_MAX ];				// キーボードの入力情報ワーク( Repeat用 )
	int m_aKeyStateRepeatCount[ DX_KEYBOARD_KEY_MAX ];			// キーリピートカウンタ
	int m_repeatDelayTime;										// リピート処理を行うまでに必要なキー押下時間
};

//==============================================================================
// プロトタイプ宣言
//==============================================================================

