//==============================================================================
// タイトル     :   OpenGL用ライトクラス
// ファイル名   :   lightGL.h
// 作成者       :   AT13B284 21 数藤凌哉
// 作成日       :   2016/05/23
//==============================================================================

//==============================================================================
// 更新履歴: -2016/05/23 数藤凌哉
//           ・制作開始
//==============================================================================

//==============================================================================
// インクルードガード
//==============================================================================
#pragma once

//==============================================================================
// インクルードファイル
//==============================================================================
#include "light.h"
#include <gl/gl.h>
#include <gl/glu.h>

//==============================================================================
// ライブラリへのリンク設定
//==============================================================================
#pragma comment( lib , "opengl32.lib" )		// OpenGL用
#pragma comment( lib , "glu32.lib" )		// OpenGL用

//==============================================================================
// マクロ定義
//==============================================================================

//==============================================================================
// 構造体宣言
//==============================================================================
struct LIGHT_PARAM
{														/* ==ライトパラメータ構造体== */
	LIGHT_PARAM()											// コンストラクタ
	{
		pos		 = VECTOR4( 0.0f , 1.0f , 0.0f , 0.0f );
		dir		 = VECTOR3( 0.0f , 0.0f , -1.0f );
		diffuse	 = COLOR_F32( 0.0f , 0.0f , 0.0f , 0.0f );
		ambient	 = COLOR_F32( 0.0f , 0.0f , 0.0f , 1.0f );
		specular = COLOR_F32( 0.0f , 0.0f , 0.0f , 0.0f );
	}

	VECTOR4 pos;											// 位置
	VECTOR3 dir;											// 方向ベクトル

	COLOR_F32 diffuse;									// 環境光
	COLOR_F32 ambient;									// 拡散光
	COLOR_F32 specular;									// 鏡面反射光
};

//==============================================================================
// クラス宣言
//==============================================================================
class CLightGL : public CLight
{
	/* ===メンバ関数=== */
public:
	CLightGL();															// デフォルトコンストラクタ
	~CLightGL();														// デストラクタ

	void SetParam( LIGHT_PARAM* param ){ m_param = *param; }			// パラメータ設定
	LIGHT_PARAM* GetParam( void ){ return &m_param; }					// パラメータ取得

	void Enable( void );												// 有効化
	void Disable( void );												// 無効化

	static CLightGL* Create( 
		LIGHT_ID id , LIGHT_PARAM* param , LIGHT_TYPE type );			// 生成処理

protected:
	bool Init( LIGHT_ID id , LIGHT_PARAM* param , LIGHT_TYPE type );	// 初期化処理
	void Uninit( void );												// 終了処理
	void Update( void );												// 更新処理
	void Set( bool enable );											// 設定処理

private:
	GLenum GetLightIdGL( void );										// ライトのIDのひも付け

	//---------------------------------------------
	// [ メンバ変数 ]
	//---------------------------------------------
public:
	LIGHT_PARAM m_param;												// パラメータ

};

//==============================================================================
// プロトタイプ宣言
//==============================================================================
