//==============================================================================
// タイトル     :   モデルデータ用基底クラス
// ファイル名   :   model.h
// 作成者       :   AT13B284 21 数藤凌哉
// 作成日       :   2016/07/05
//==============================================================================

//==============================================================================
// 更新履歴: -2016/07/05 数藤凌哉
//           ・制作開始
//==============================================================================

//==============================================================================
// インクルードガード
//==============================================================================
#pragma once

//==============================================================================
// インクルードファイル
//==============================================================================
#include <Windows.h>
#include "texture.h"

//==============================================================================
// マクロ定義
//==============================================================================

//==============================================================================
// 構造体宣言
//==============================================================================

//==============================================================================
// クラス宣言
//==============================================================================
class CModel
{
	//---------------------------------------------
	// [ メンバ関数 ]
	//---------------------------------------------
public:
	CModel();
	~CModel();

	static void ReleaseAll( void );

	virtual bool Init( char* modelPath );
	virtual void Uninit( void );

	virtual bool DrawSubset( DWORD attribId ) = 0;

	virtual bool SetMaterial( DWORD attribId ) = 0;
	virtual bool SetMatTexture( DWORD attribId ) = 0;

	DWORD GetMaterialNum( void ){ return m_matNum; }

	CModel* GetNext( void ){ return m_pNext; }
	static CModel* GetTop( void ){ return m_pTop; }

	bool ModelPathCmp( char* modelPath );

protected:
	void Release( void );
	void LinkList( void );
	void UnlinkList( void );

	//---------------------------------------------
	// [ メンバ変数 ]
	//---------------------------------------------
protected:
	static CModel* m_pTop;							// リストの先頭ポインタ
	static CModel* m_pCur;							// リストの現在位置のポインタ

	CModel* m_pPrev;								// リストの前参照用ポインタ
	CModel* m_pNext;								// リストの後参照用ポインタ

	DWORD m_matNum;									// マテリアル数
	CTexture** m_ppMatTex;							// マテリアルに紐付いたテクスチャの動的ポインタ配列

	char m_modelPath[ MAX_PATH ];					// 識別用ファイルパス( 同一テクスチャの読み込みを防止する )

};

typedef class CModel* LPModel;

//==============================================================================
// プロトタイプ宣言
//==============================================================================
