//==============================================================================
// タイトル     :   描画用クラス
// ファイル名   :   scene.cpp
// 作成者       :   AT13B284 21 数藤凌哉
// 作成日       :   2016/04/19
//==============================================================================

//==============================================================================
// 更新履歴: -2016/04/19 数藤凌哉
//           ・制作開始
//           -2016/06/20
//           ・リスト管理機構を追加
//==============================================================================

//==============================================================================
// インクルードファイル
//==============================================================================
#include "scene.h"

//==============================================================================
// 列挙型宣言
//==============================================================================

//==============================================================================
// マクロ定義
//==============================================================================

//==============================================================================
// 構造体宣言
//==============================================================================

//==============================================================================
// プロトタイプ宣言
//==============================================================================

//==============================================================================
// グローバル宣言
//==============================================================================

//==============================================================================
// 静的変数
//==============================================================================
CScene* CScene::m_pTop = NULL;
CScene* CScene::m_pCur = NULL;
int     CScene::m_numInstance = 0;

//==============================================================================
// 関数名 : CScene()
// 引数   : void
// 戻り値 : void
// 説明   : デフォルトコンストラクタ
//==============================================================================
CScene::CScene()
{
	//--------------------------------------
	// [ インスタンスをリストに登録する ]
	//--------------------------------------
	m_numInstance++;	// 登録総数増加

	LinkList();			// リストへの登録処理

	//--------------------------------------
	// [ 変数初期化 ]
	//--------------------------------------
	m_type = SCENE_TYPE_UNKNOWN;
}

//==============================================================================
// 関数名 : ~CScene()
// 引数   : void
// 戻り値 : void
// 説明   : デストラクタ
//==============================================================================
CScene::~CScene()
{
}

//==============================================================================
// 関数名 : void UpdateAll( void )
// 引数   : void
// 戻り値 : void
// 説明   : リストに登録されたインスタンス全ての更新処理
//==============================================================================
void CScene::UpdateAll( void )
{
	CScene *pCur = m_pTop;				// 現在参照しているポインタ
	CScene *pNext;						// 次に参照するポインタ

	while( pCur != NULL )				// リスト全てを参照するまで繰り返し
	{
		pNext = pCur->m_pNext;			// 次へのポインタを保持
		pCur->Update();					// 更新処理の呼び出し
		pCur = pNext;					// 次へのポインタを現在のポインタに格納
	}
}


//==============================================================================
// 関数名 : void DrawAll( void )
// 引数   : void
// 戻り値 : void
// 説明   : リストに登録されたインスタンス全ての描画処理
//==============================================================================
void CScene::DrawAll( void )
{
	CScene *pCur = m_pTop;				// 現在参照しているポインタ
	CScene *pNext;						// 次に参照するポインタ

	while( pCur != NULL )				// リスト全てを参照するまで繰り返し
	{
		pNext = pCur->m_pNext;			// 次へのポインタを保持
		pCur->Draw();					// 描画処理の呼び出し
		pCur = pNext;					// 次へのポインタを現在のポインタに格納
	}
}

//==============================================================================
// 関数名 : void ReleaseAll( void )
// 引数   : void
// 戻り値 : void
// 説明   : リストに登録されたインスタンス全ての解放処理
//==============================================================================
void CScene::ReleaseAll( void )
{
	CScene *pCur = m_pTop;				// 現在参照しているポインタ
	CScene *pNext;						// 次に参照するポインタ

	while( pCur != NULL )				// リスト全てを参照するまで繰り返し
	{
		pNext = pCur->m_pNext;			// 次へのポインタを保持
		pCur->Uninit();					// 終了処理の呼び出し
		delete pCur;					// インスタンスの削除
		pCur = pNext;					// 次へのポインタを現在のポインタに格納
	}
}

//==============================================================================
// 関数名 : void Release( void )
// 引数   : void
// 戻り値 : void
// 説明   : 解放処理
//==============================================================================
void CScene::Release( void )
{
	this->Uninit();		// 終了処理呼び出し
	UnlinkList();		// リストから解放
	delete this;		// インスタンス削除
}

//==============================================================================
// 関数名 : void LinkList( void )
// 引数   : void
// 戻り値 : void
// 説明   : リストへインスタンスを登録する処理
//==============================================================================
void CScene::LinkList( void )
{
	// リストに初めて自身を登録するとき
	if( m_pTop == NULL )
	{
		m_pTop = this;							// 自身しかいない＝先頭にあたるため
	}

	if( m_pCur == NULL )
	{
		m_pCur = this;							// 自身しかいない＝最後尾にあたるため
	}

	// リストのリンク処理
	m_pCur->m_pNext = this;						// 現在最後尾にあたる部分のNextを自身に設定

	if( m_pCur == this )
	{
		m_pPrev = NULL;							// 自身しかいない＝前にリストが存在しないため
	}
	else
	{
		m_pPrev = m_pCur;						// 最後尾が自身になるため
	}

	m_pCur = this;								// 最後尾を自身に登録
	m_pNext = NULL;								// 次はまだ存在しないため
}

//==============================================================================
// 関数名 : void UnlinkList( void )
// 引数   : void
// 戻り値 : void
// 説明   : リストのインスタンスを削除する処理
//==============================================================================
void CScene::UnlinkList( void )
{
	// 前にあるインスタンスに対する処理
	if( this == m_pTop )
	{
		m_pTop = m_pNext;
	}
	else
	{
		m_pPrev->m_pNext = m_pNext;		// 前にあるインスタンスに、自身の次のインスタンスへのポインタを登録
	}

	// 次にあるインスタンスに対する処理
	if( this == m_pCur )
	{
		m_pCur = m_pPrev;
	}
	else
	{
		m_pNext->m_pPrev = m_pPrev;		// 次にあるインスタンスに、自身の前のインスタンスへのポインタを登録
	}
}
