//==============================================================================
// タイトル     :   BMP画像読み込み用クラス
// ファイル名   :   texLoaderBMP.h
// 作成者       :   AT13B284 21 数藤凌哉
// 作成日       :   2016/05/02
//==============================================================================

//==============================================================================
// 更新履歴: -2016/05/02 数藤凌哉
//           ・制作開始
//==============================================================================

//==============================================================================
// インクルードガード
//==============================================================================
#pragma once

//==============================================================================
// インクルードファイル
//==============================================================================
#include "textureGL.h"
#include <Windows.h>
#include <stdio.h>
#include <gl/gl.h>
#include <gl/glu.h>

//==============================================================================
// ライブラリへのリンク設定
//==============================================================================
#pragma comment( lib , "opengl32.lib" )		// OpenGL用
#pragma comment( lib , "glu32.lib" )		// OpenGL用

//==============================================================================
// マクロ定義
//==============================================================================

//==============================================================================
// 構造体宣言
//==============================================================================

//==============================================================================
// クラス宣言
//==============================================================================
class CTexLoaderBMP
{
	/* ===メンバ関数=== */
public:
	CTexLoaderBMP(){};
	~CTexLoaderBMP(){};

	bool TextuerLoadBMP( char* path , CTexture** ppTexture );							// BMP画像読み込み関数

private:
	bool TextuerLoadBMP_BIT_1( FILE* fp , LONG width , LONG height , GLubyte* bits );	// 色ビット数1のBMP画像読み込み関数
	bool TextuerLoadBMP_BIT_4( FILE* fp , LONG width , LONG height , GLubyte* bits );	// 色ビット数4のBMP画像読み込み関数
	bool TextuerLoadBMP_BIT_8( FILE* fp , LONG width , LONG height , GLubyte* bits );	// 色ビット数8のBMP画像読み込み関数
	bool TextuerLoadBMP_BIT_24( FILE* fp , LONG width , LONG height , GLubyte* bits );	// 色ビット数24のBMP画像読み込み関数
	bool TextuerLoadBMP_BIT_32( FILE* fp , LONG width , LONG height , GLubyte* bits );	// 色ビット数32のBMP画像読み込み関数

	bool TextureLoadPNG( char* path , CTexture** ppTexture );							// PNG画像読み込み関数

	void ErrorMsg( char* errorMsg , char* path = NULL );								// エラー表示用関数

	/* ===メンバ変数=== */
private:

};

//==============================================================================
// プロトタイプ宣言
//==============================================================================
