//==============================================================================
// タイトル     :   TGA画像読み込み用クラス
// ファイル名   :   texLoaderTGA.h
// 作成者       :   AT13B284 21 数藤凌哉
// 作成日       :   2016/05/06
//==============================================================================

//==============================================================================
// 更新履歴: -2016/05/06 数藤凌哉
//           ・制作開始
//==============================================================================

//==============================================================================
// インクルードガード
//==============================================================================
#pragma once

//==============================================================================
// インクルードファイル
//==============================================================================
#include "textureGL.h"

//==============================================================================
// ライブラリへのリンク設定
//==============================================================================

//==============================================================================
// マクロ定義
//==============================================================================

//==============================================================================
// 構造体宣言
//==============================================================================

//==============================================================================
// クラス宣言
//==============================================================================
class CTexLoaderTGA
{
	/* ===メンバ関数=== */
public:
	CTexLoaderTGA(){}											// デフォルトコンストラクタ
	~CTexLoaderTGA(){}											// デストラクタ

	bool TextuerLoadTGA( char* path , CTexture** ppTexture );	// TGA画像読み込み関数

private:
	void ErrorMsg( char* errorMsg , char* path );

	/* ===メンバ変数=== */
private:

	struct TGA_HEADER
	{									/* ===TGAヘッダー構造体=== */
		unsigned char  IDFieldLength;		// IDフィールド長
		unsigned char  colormapType;		// カラーマップタイプ
		unsigned char  type;				// 画像タイプ
		unsigned short colormapOrigin;		// カラーマップ原点
		unsigned short colormapLength;		// カラーマップ長
		unsigned char  colormapDepth;		// カラーマップ深度
		unsigned short originX;				// 画像X方向原点
		unsigned short originY;				// 画像Y方向原点
		unsigned short width;				// 画像幅
		unsigned short height; 				// 画像高さ
		unsigned char  depth;				// 画像深度
		unsigned char  descriptor;			// 画像デスクリプタ
	};

	TGA_HEADER m_header;					// ヘッダー情報

};

//==============================================================================
// プロトタイプ宣言
//==============================================================================
